InformationRegisters/ПраваИНастройки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ПраваИНастройки</Name>
			<Comment>Хранит права доступа и настройки окружения пользователей</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Comment>Значение права / настройки</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ПраваИНастройки</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПользовательПрофиль</Name>
					<Comment>Пользователь/Профиль</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ГруппыДоступа</v8:Type>
						<v8:Type>cfg:CatalogRef.ГруппыПравИНастроек</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПравоНастройка</Name>
					<Comment>Право или настройка, по которой хранится значение</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ПраваИНастройки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект, на уровне которого производится настройка</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Comment>АПК:413 - №744.2.1.1 Допустимо не отключать историю выбора, так как она используется, а переопределение отбора фиксированное, то есть служебные и недействительные пользователи в нее не попадут, но если как-то попали, то это не является проблемой</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Comment>Содержит ссылку на график работы</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Подразделение</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФизическоеЛицо</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Comment>Идентификационный номер налогоплательщика</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользованиеПерсональногоДоступа</Name>
					<Comment>Пользователь имеет собственные права и настройки, в группе доступа не участвует</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подготовлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяИБ</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяСервиса</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСвойстваПользователяИБ</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Comment>Сотрудник</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>сфпТекущийВнутреннийНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фотография</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаПравИНастроек</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПравИНастроек</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonForms/сфпПользователиДляПереключения/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура - обработчик события формы "ПриСозданииНаСервере"
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ сфпСофтФонПроСервер.сфпИспользоватьМаршрутизацию() ИЛИ НЕ Параметры.Свойство("Контакт") Тогда
		Отказ = Истина;
		СтандартнаяОбработка = Ложь;

	Иначе	
		Контакт = Параметры.Контакт;
		Пользователь = сфпСофтФонПроСервер.сфпПолучитьПользователяДляПереключенияЗвонков(Контакт);
		
		Список.Параметры.УстановитьЗначениеПараметра("Пользователь", Пользователь);
	КонецЕсли;
	
	// АльфаАвто
	Список.ТекстЗапроса = "ВЫБРАТЬ
	|	НастройкиПользователей.ПользовательПрофиль КАК ПользовательПрофиль,
	|	НастройкиПользователей.Значение КАК Значение,
	|	ВЫБОР
	|		КОГДА НастройкиПользователей.ПользовательПрофиль = &Пользователь
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ВыбранныйПользователь
	|ИЗ
	|	РегистрСведений.ПраваИНастройки КАК НастройкиПользователей
	|ГДЕ
	|	НастройкиПользователей.ПравоНастройка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ПраваИНастройки.сфпТекущийВнутреннийНомер)
	|	И НастройкиПользователей.Значение <> """"";
	// Конец АльфаАвто
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
// Процедура - обработчик события формы "ПриОткрытии"
//
Процедура ПриОткрытии(Отказ)
	
	Если НЕ ЗначениеЗаполнено(Пользователь) Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.Список.ТекущаяСтрока = сфпПолучитьКлючЗаписи(Пользователь);

	Элементы.СписокОчиститьПользователя.Доступность = ЗначениеЗаполнено(Пользователь);
	
КонецПроцедуры // ПриОткрытии()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
// Процедура - обработчик события "Выбор" таблицы формы "Список"
//
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ПриВыбореПользователяДляПереключения();
КонецПроцедуры // СписокВыбор()

#КонецОбласти

#Область ОбработчикиКомандФормы
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
// Функция возвращает выбранного пользователя
//
// Параметры:
//	ВыбраннаяСтрока	- РегистрСведенийКлючЗаписи	- Выбранная запись 
//
// Возвращаемое значение:
//	СправочникСсылка	- Выбранный пользователь
//
Функция ПолучитьВыбранногоПользователя(ВыбраннаяСтрока)
	Возврат ВыбраннаяСтрока.Пользователь;
КонецФункции // ПолучитьВыбранногоПользователя()	

&НаСервере
// Функция возвращает ключ записи настройки внутреннего номера для пользователя
//
// Параметры:
//	Пользователь	- СправочникСсылка	- Пользователь
//
// Возвращаемое значение:
//	РегистрСведенийКлючЗаписи	- Ключ записи
//
Функция сфпПолучитьКлючЗаписи(Пользователь)
	
	ИмяПВХ_СофтфонНастройкиПользователей = сфпСофтФонПроСервер.сфпИмяПВХ_СофтфонНастройкиПользователей();
	ИмяРегистраСофтфонНастройкиПользователей = сфпСофтФонПроСервер.сфпИмяРегистраСофтфонНастройкиПользователей();
	
	СтруктураОтбора = Новый Структура();
	// АльфаАвто
	СтруктураОтбора.Вставить("ПользовательПрофиль", Пользователь);
	// Конец АльфаАвто
	СтруктураОтбора.Вставить("Настройка", ПланыВидовХарактеристик[ИмяПВХ_СофтфонНастройкиПользователей].сфпТекущийВнутреннийНомер);
	Возврат РегистрыСведений[ИмяРегистраСофтфонНастройкиПользователей].СоздатьКлючЗаписи(СтруктураОтбора);

КонецФункции // сфпПолучитьКлючЗаписи()	

&НаКлиенте
Процедура ВыбратьПользователя(Команда)
	ПриВыбореПользователяДляПереключения();
КонецПроцедуры

&НаКлиенте
Процедура ПриВыбореПользователяДляПереключения()
	
	ТекДанные = Элементы.Список.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекДанные.Пользователь = Пользователь Тогда
		Возврат;
	КонецЕсли;
	
	ВнутреннийНомер	= сфпСофтФонПроСервер.сфпТекущийВнутреннийНомер(ТекДанные.Пользователь);
	Если ПустаяСтрока(ВнутреннийНомер) Тогда
		Возврат;
	КонецЕсли;
	
	СтарыйНабор	= сфпСофтФонПроСервер.сфпПолучитьТаблицуМаршрутизации(Контакт, Пользователь);
	ПользовательОбновлен = сфпСофтФонПроСервер.сфпЗаписатьНовогоПользователя(Контакт, ТекДанные.Пользователь);
	Если ПользовательОбновлен Тогда
		НовыйНабор = сфпСофтФонПроСервер.сфпПолучитьТаблицуМаршрутизации(Контакт, ТекДанные.Пользователь);
		СписокМаршрутизации = сфпСофтФонПроСервер.сфпСформироватьСписокМаршрутизации(СтарыйНабор, НовыйНабор);
		сфпСофтФонПроСервер.сфпИзменитьМаршрутизациюВАТС(СписокМаршрутизации);
	КонецЕсли;
	
	ОповеститьОВыборе(ТекДанные.Пользователь);

КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПользователя(Команда)
	
	НовыйПользователь = ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка");
	
	СтарыйНабор	= сфпСофтФонПроСервер.сфпПолучитьТаблицуМаршрутизации(Контакт, Пользователь);
	ПользовательОбновлен = сфпСофтФонПроСервер.сфпЗаписатьНовогоПользователя(Контакт, НовыйПользователь);
	Если ПользовательОбновлен Тогда
		НовыйНабор = сфпСофтФонПроСервер.сфпПолучитьТаблицуМаршрутизации(Контакт, НовыйПользователь);
		СписокМаршрутизации = сфпСофтФонПроСервер.сфпСформироватьСписокМаршрутизации(СтарыйНабор, НовыйНабор);
		сфпСофтФонПроСервер.сфпИзменитьМаршрутизациюВАТС(СписокМаршрутизации);
	КонецЕсли;
	
	ОповеститьОВыборе(НовыйПользователь);

КонецПроцедуры

#КонецОбласти
